{
  "glossary": [
    {
      "term": "Logic Circuit",
      "definition": "An electrical circuit that performs logical operations on binary inputs to produce a binary output."
    },
    {
      "term": "Binary System",
      "definition": "A numeral system that uses only two digits, 0 and 1, as the foundation of digital electronics and computing systems."
    },
    {
      "term": "Boolean Algebra",
      "definition": "A branch of algebra that deals with binary variables and logical operations, forming the theoretical foundation for logic circuits."
    },
    {
      "term": "Logic Gate",
      "definition": "A basic building block of logic circuits that performs a simple logical function such as AND, OR, NOT, NAND, NOR, XOR, or XNOR."
    },
    {
      "term": "AND Gate",
      "definition": "A logic gate that produces a true (1) output only if all its inputs are true."
    },
    {
      "term": "OR Gate",
      "definition": "A logic gate that produces a true (1) output if at least one of its inputs is true."
    },
    {
      "term": "NOT Gate",
      "definition": "A logic gate that inverts its input signal; true becomes false, and false becomes true."
    },
    {
      "term": "NAND Gate",
      "definition": "A logic gate that produces a false (0) output only if all its inputs are true, which is the negation of the AND gate."
    },
    {
      "term": "NOR Gate",
      "definition": "A logic gate that produces a true (1) output only when all its inputs are false."
    },
    {
      "term": "XOR Gate",
      "definition": "A logic gate that produces a true (1) output only when the number of true inputs is odd."
    },
    {
      "term": "XNOR Gate",
      "definition": "A logic gate that produces a true (1) output only when the number of true inputs is even."
    },
    {
      "term": "Truth Table",
      "definition": "A table used to represent the logical relationship between inputs and outputs of a logic gate or circuit."
    },
    {
      "term": "Combinational Circuit",
      "definition": "A type of logic circuit where the output is determined solely by the current inputs."
    },
    {
      "term": "Sequential Circuit",
      "definition": "A type of logic circuit where the output depends on both current inputs and previous states, often using memory elements like flip-flops."
    },
    {
      "term": "Flip-Flop",
      "definition": "A digital memory circuit that can hold one bit of information, used in sequential circuits."
    }
  ]
}
